Revit 2027 API
AnalysisDisplayDeformedShapeSettings.TextTypeId Property
 Element id of text associated with the settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TextTypeId { get; set; }
Public Property TextTypeId As ElementId
	Get
	Set
public:
property ElementId^ TextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TextTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace